IDEA StatiCa Open Model
BeamDataEc2.CheckLimitDeflRheoEffects Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 true for check of limit deflection for beam span from rheological effects of variable loads
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool CheckLimitDeflRheoEffects { get; set; }
Public Property CheckLimitDeflRheoEffects As Boolean
	Get
	Set
public:
property bool CheckLimitDeflRheoEffects {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
BeamDataEc2 Class
IdeaRS.OpenModel.Concrete Namespace